; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v6)
             (pred_9 ?v8 ?v5)
             (pred_1 ?v13 ?v5)
             (pred_6 ?v3 ?v13 )
	     (pred_7 ?v13)
             (pred_12 ?v11)
             (pred_11 ?v8)
             (pred_10 ?v5)
             (pred_2 ?v13)
             (pred_4 ?v8)
             (pred_5 ?v13)
             (pred_8 ))



(:action op_5
:parameters (?v12 ?v1 ?v10 ?v4)
:precondition (and (pred_12 ?v12) (pred_12 ?v1) (pred_11 ?v10) (pred_10 ?v4)
          (pred_3 ?v12 ?v1) (pred_9 ?v10 ?v4)
                   (pred_1 ?v1 ?v4) (pred_7 ?v12) 
                   (pred_2 ?v1) (pred_4 ?v10))
:effect (and  (pred_5 ?v1) (not (pred_2 ?v1))))


(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_12 ?v9)
               (pred_7 ?v12) (pred_3 ?v12 ?v9) (pred_5 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v12))))

(:action op_4
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_11 ?v10) 
                  (pred_7 ?v12) (pred_6 ?v10 ?v12) (pred_8 ))
:effect (and (pred_4 ?v10)
   (not (pred_6 ?v10 ?v12)) (not (pred_8 ))))


(:action op_2
:parameters (?v12 ?v7 ?v2)
:precondition (and (pred_12 ?v12) (pred_11 ?v7) (pred_11 ?v2)
                  (pred_7 ?v12) (pred_4 ?v2) (pred_6 ?v7 ?v12))
:effect (and (pred_4 ?v7) (pred_6 ?v2 ?v12)
        (not (pred_4 ?v2)) (not (pred_6 ?v7 ?v12))))

(:action op_3
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_11 ?v10) 
                  (pred_7 ?v12) (pred_4 ?v10))
:effect (and (pred_8 ) (pred_6 ?v10 ?v12) (not (pred_4 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_14 obj_03 obj_21 obj_18 obj_17 obj_08 obj_15 obj_09 obj_22 obj_13 obj_02 obj_19 obj_10 obj_12 obj_20
    obj_01 obj_07 obj_11
    obj_16 obj_04 obj_05
    )

    (:init
       (pred_8)

       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_03)
       (pred_12 obj_21)
       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_22)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_11)
       (pred_11 obj_16)
       (pred_11 obj_04)
       (pred_11 obj_05)

       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_17 obj_22)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_09 obj_19)
       (pred_3 obj_09 obj_22)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_22 obj_13)
       (pred_3 obj_22 obj_17)
       (pred_3 obj_22 obj_09)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_13 obj_22)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_19 obj_09)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_20 obj_12)
       (pred_2 obj_19)
       (pred_2 obj_12)
       (pred_2 obj_06)
       (pred_1  obj_19 obj_01)
       (pred_1  obj_12 obj_07)
       (pred_1  obj_06 obj_11)
       (pred_5 obj_14)
       (pred_5 obj_03)
       (pred_5 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_15)
       (pred_5 obj_09)
       (pred_5 obj_22)
       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_20)

       (pred_9  obj_16 obj_01)
       (pred_9  obj_04 obj_07)
       (pred_9  obj_05 obj_11)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_05 obj_02)
       (pred_7 obj_22)
    )

    (:goal (and
       (pred_6 obj_04 obj_20)
    ))
(:constraints
  (always (not (pred_7 obj_13)))
)
)

; plan
1. (op_1 obj_22 obj_17)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_17)
   goals met: 0 of 1
2. (op_1 obj_17 obj_08)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_03)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_03)
   goals met: 0 of 1
4. (op_4 obj_03 obj_04)
   deleted: (pred_6 obj_04 obj_03) (pred_8)
   added: (pred_4 obj_04)
   goals met: 0 of 1
5. (op_1 obj_03 obj_21)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_21)
   goals met: 0 of 1
6. (op_1 obj_21 obj_15)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_15)
   goals met: 0 of 1
7. (op_1 obj_15 obj_02)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_02)
   goals met: 0 of 1
8. (op_1 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 1
9. (op_3 obj_20 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_8) (pred_6 obj_04 obj_20)
   goals met: 1 of 1
